Repository: CodyBontecou/GitSync.md
Catalog: Sync.md/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, he, hi, hu, id, it, ja, ko, nb, nl, pl, pt_br, ru, sv, th, tr, uk, vi, zh_hans, zh_hant

source: Global consent begins only after you confirm Background Sync. The app never sends repository names, URLs, contents, local paths, or Git credentials to relay APIs. During GitHub App linking, the browser sends a transient OAuth code; the relay uses a single-purpose transient GitHub App user token only to verify personal-owner or organization-owner authority, stores only the numeric authorizing user ID, never persists or application-logs either credential, and best-effort revokes the token. Signed GitHub webhook payloads may include GitHub-provided repository, commit, path, and author metadata; the relay extracts only numeric repository ID plus branch and delivery data and does not persist or log names, URLs, commit messages, changed paths, authors, contents, or credentials. APNs payloads contain only opaque IDs.
ar: لا تبدأ الموافقة الشاملة إلا بعد تأكيد Background Sync. لا يرسل التطبيق مطلقًا أسماء المستودعات أو عناوين URL أو المحتويات أو المسارات المحلية أو بيانات اعتماد Git إلى واجهات API الخاصة بالمُرحِّل. أثناء ربط GitHub App، يرسل المتصفح رمز OAuth مؤقتًا؛ ويستخدم المُرحِّل رمز مستخدم مؤقتًا أحادي الغرض من GitHub App فقط للتحقق من صلاحية مالك شخصي أو مالك مؤسسة، ولا يخزن سوى معرّف المستخدم الرقمي الذي منح التفويض، ولا يحتفظ بأي من بيانات الاعتماد أو يسجلها في سجلات التطبيق، ويبذل أفضل جهد لإبطال الرمز. قد تتضمن حمولات webhook الموقعة من GitHub بيانات وصفية يقدمها GitHub عن المستودع وcommit والمسار والمؤلف؛ ولا يستخرج المُرحِّل سوى معرّف المستودع الرقمي إلى جانب بيانات الفرع والتسليم، ولا يحتفظ بالأسماء أو عناوين URL أو رسائل commit أو المسارات المتغيرة أو المؤلفين أو المحتويات أو بيانات الاعتماد ولا يسجلها. لا تحتوي حمولات APNs إلا على معرّفات مبهمة.
da: Globalt samtykke træder først i kraft, når du bekræfter Background Sync. Appen sender aldrig arkivnavne, URL-adresser, indhold, lokale stier eller Git-legitimationsoplysninger til relæets API’er. Under tilknytning af GitHub App sender browseren en midlertidig OAuth-kode. Relæet bruger kun et midlertidigt GitHub App-brugertoken med ét formål til at bekræfte rettigheder som personlig ejer eller organisationsejer, gemmer kun det numeriske ID for brugeren, der godkender, opbevarer eller programlogger aldrig nogen af legitimationsoplysningerne og forsøger efter bedste evne at tilbagekalde tokenet. Signerede GitHub-webhook-data kan indeholde metadata fra GitHub om arkiv, commit, sti og forfatter. Relæet udtrækker kun numerisk arkiv-ID samt branch- og leveringsdata og opbevarer eller logger ikke navne, URL-adresser, commit-beskeder, ændrede stier, forfattere, indhold eller legitimationsoplysninger. APNs-data indeholder kun uigennemsigtige ID’er.
de: Die globale Einwilligung beginnt erst, nachdem Sie Background Sync bestätigt haben. Die App sendet niemals Repository-Namen, URLs, Inhalte, lokale Pfade oder Git-Anmeldedaten an Relay-APIs. Beim Verknüpfen von GitHub App sendet der Browser einen temporären OAuth-Code. Das Relay verwendet ein vorübergehendes GitHub App-Benutzertoken mit nur einem Zweck, um die Berechtigung als persönlicher Eigentümer oder Organisationseigentümer zu prüfen, speichert ausschließlich die numerische ID des autorisierenden Benutzers, speichert oder protokolliert keines der beiden Anmeldedaten und versucht nach bestem Bemühen, das Token zu widerrufen. Signierte GitHub-Webhook-Nutzdaten können von GitHub bereitgestellte Metadaten zu Repository, commit, Pfad und Autor enthalten. Das Relay extrahiert nur die numerische Repository-ID sowie Branch- und Zustellungsdaten und speichert oder protokolliert keine Namen, URLs, commit-Nachrichten, geänderten Pfade, Autoren, Inhalte oder Anmeldedaten. APNs-Nutzdaten enthalten nur nicht aussagekräftige IDs.
es: El consentimiento global solo comienza después de confirmar Background Sync. La app nunca envía a las API del relé nombres, URL, contenido, rutas locales ni credenciales de Git de los repositorios. Durante la vinculación de GitHub App, el navegador envía un código OAuth transitorio; el relé usa un token de usuario transitorio y de propósito único de GitHub App solo para verificar la autoridad del propietario personal o de la organización, almacena únicamente el ID numérico del usuario que autoriza, nunca conserva ni registra en los registros de la aplicación ninguna de las credenciales y revoca el token sin garantías. Las cargas útiles firmadas de los webhooks de GitHub pueden incluir metadatos proporcionados por GitHub sobre el repositorio, el commit, la ruta y el autor; el relé solo extrae el ID numérico del repositorio, además de la rama y los datos de entrega, y no conserva ni registra nombres, URL, mensajes de commit, rutas modificadas, autores, contenido ni credenciales. Las cargas útiles de APNs solo contienen ID opacos.
fi: Yleinen suostumus tulee voimaan vasta, kun vahvistat Background Sync -toiminnon. Sovellus ei koskaan lähetä tietovarastojen nimiä, URL-osoitteita, sisältöä, paikallisia polkuja tai Git-tunnistetietoja välityspalvelun API-rajapinnoille. GitHub App -linkityksen aikana selain lähettää väliaikaisen OAuth-koodin. Välityspalvelu käyttää kertakäyttöistä, väliaikaista GitHub App -käyttäjätunnistetta vain henkilökohtaisen omistajan tai organisaation omistajan valtuuksien tarkistamiseen. Se tallentaa vain valtuuttavan käyttäjän numeerisen tunnuksen, ei koskaan säilytä kumpaakaan tunnistetietoa tai kirjaa niitä sovelluslokiin ja yrittää parhaansa mukaan kumota tunnisteen. Allekirjoitetut GitHub-webhook-hyötykuormat voivat sisältää GitHubin toimittamia tietovaraston, commit-toiminnon, polun ja tekijän metatietoja. Välityspalvelu poimii vain tietovaraston numeerisen tunnuksen sekä haaran ja toimituksen tiedot eikä säilytä tai kirjaa nimiä, URL-osoitteita, commit-viestejä, muutettuja polkuja, tekijöitä, sisältöä tai tunnistetietoja. APNs-hyötykuormat sisältävät vain läpinäkymättömiä tunnuksia.
fr: Le consentement global ne prend effet qu’après votre confirmation de Background Sync. L’app n’envoie jamais aux API du relais les noms, URL, contenus, chemins locaux ou identifiants Git des dépôts. Lors de la liaison à GitHub App, le navigateur envoie un code OAuth temporaire ; le relais utilise un jeton utilisateur GitHub App temporaire et à usage unique uniquement pour vérifier l’autorité du propriétaire personnel ou du propriétaire de l’organisation. Il ne stocke que l’identifiant numérique de l’utilisateur qui donne son autorisation, ne conserve ni ne journalise dans l’application aucun des identifiants et révoque le jeton sans garantie. Les charges utiles signées des webhooks GitHub peuvent inclure des métadonnées fournies par GitHub sur le dépôt, le commit, le chemin et l’auteur ; le relais extrait uniquement l’identifiant numérique du dépôt, ainsi que les données de branche et de livraison, et ne conserve ni ne journalise les noms, URL, messages de commit, chemins modifiés, auteurs, contenus ou identifiants. Les charges utiles APNs ne contiennent que des identifiants opaques.
he: ההסכמה הכוללת מתחילה רק לאחר אישור Background Sync. היישום לעולם אינו שולח לממשקי ה-API של הממסר שמות מאגרים, כתובות URL, תוכן, נתיבים מקומיים או פרטי כניסה של Git. במהלך קישור GitHub App, הדפדפן שולח קוד OAuth זמני; הממסר משתמש באסימון משתמש זמני וייעודי של GitHub App רק כדי לאמת סמכות של בעלים אישיים או של בעלי ארגון, שומר רק את מזהה המשתמש המספרי שנתן הרשאה, לעולם אינו שומר או מתעד ביומן היישום אף אחד מפרטי הכניסה, ומבטל את האסימון במאמץ מיטבי. מטעני webhook חתומים של GitHub עשויים לכלול מטא-נתונים שסיפק GitHub על מאגר, commit, נתיב ומחבר; הממסר מחלץ רק מזהה מאגר מספרי לצד נתוני ענף ומסירה, ואינו שומר או מתעד שמות, כתובות URL, הודעות commit, נתיבים שהשתנו, מחברים, תוכן או פרטי כניסה. מטעני APNs מכילים מזהים אטומים בלבד.
hi: व्यापक सहमति आपके द्वारा Background Sync की पुष्टि करने के बाद ही लागू होती है। ऐप कभी भी रिपॉज़िटरी के नाम, URL, सामग्री, स्थानीय पाथ या Git क्रेडेंशियल रिले API को नहीं भेजता। GitHub App लिंक करते समय ब्राउज़र एक अस्थायी OAuth कोड भेजता है; रिले केवल निजी स्वामी या संगठन-स्वामी के अधिकार की पुष्टि के लिए एकल-उद्देश्य वाला अस्थायी GitHub App उपयोगकर्ता टोकन इस्तेमाल करता है, केवल अधिकृत करने वाले उपयोगकर्ता की संख्यात्मक ID रखता है, किसी भी क्रेडेंशियल को कभी स्थायी रूप से नहीं रखता या ऐप्लिकेशन लॉग में दर्ज नहीं करता और यथासंभव टोकन निरस्त करता है। हस्ताक्षरित GitHub webhook पेलोड में GitHub द्वारा दिए गए रिपॉज़िटरी, commit, पाथ और लेखक के मेटाडेटा हो सकते हैं; रिले केवल संख्यात्मक रिपॉज़िटरी ID, ब्रांच और डिलीवरी डेटा निकालता है और नाम, URL, commit संदेश, बदले हुए पाथ, लेखक, सामग्री या क्रेडेंशियल को स्थायी रूप से नहीं रखता या लॉग नहीं करता। APNs पेलोड में केवल अपारदर्शी ID होते हैं।
hu: Az általános hozzájárulás csak a Background Sync megerősítése után lép életbe. Az alkalmazás soha nem küld tárolóneveket, URL-eket, tartalmakat, helyi elérési utakat vagy Git-hitelesítő adatokat a továbbító API-jainak. A GitHub App összekapcsolásakor a böngésző átmeneti OAuth-kódot küld; a továbbító egy egyszeri célú, átmeneti GitHub App-felhasználói tokent használ kizárólag a személyes tulajdonosi vagy szervezettulajdonosi jogosultság ellenőrzésére, csak az engedélyező felhasználó numerikus azonosítóját tárolja, egyik hitelesítő adatot sem őrzi meg és nem naplózza az alkalmazásban, a tokent pedig lehetőség szerint visszavonja. Az aláírt GitHub webhook-adattartalmak tartalmazhatnak a GitHub által biztosított, tárolóra, commit műveletre, elérési útra és szerzőre vonatkozó metaadatokat; a továbbító csak a numerikus tárolóazonosítót, valamint az ág- és kézbesítési adatokat nyeri ki, és nem őriz meg vagy naplóz neveket, URL-eket, commit-üzeneteket, módosított elérési utakat, szerzőket, tartalmakat vagy hitelesítő adatokat. Az APNs-adattartalmak csak átlátszatlan azonosítókat tartalmaznak.
id: Persetujuan global baru berlaku setelah Anda mengonfirmasi Background Sync. Aplikasi tidak pernah mengirim nama, URL, isi, path lokal repositori, atau kredensial Git ke API relay. Saat menautkan GitHub App, browser mengirim kode OAuth sementara; relay menggunakan token pengguna GitHub App sementara dengan satu tujuan hanya untuk memverifikasi kewenangan pemilik pribadi atau pemilik organisasi, hanya menyimpan ID numerik pengguna yang memberi otorisasi, tidak pernah menyimpan atau mencatat salah satu kredensial dalam log aplikasi, dan berupaya sebaik mungkin untuk mencabut token tersebut. Payload webhook GitHub yang ditandatangani dapat menyertakan metadata repositori, commit, path, dan penulis yang diberikan GitHub; relay hanya mengambil ID numerik repositori beserta branch dan data pengiriman, serta tidak menyimpan atau mencatat nama, URL, pesan commit, path yang diubah, penulis, isi, atau kredensial. Payload APNs hanya berisi ID buram.
it: Il consenso globale inizia solo dopo la conferma di Background Sync. L’app non invia mai alle API relay nomi, URL, contenuti, percorsi locali dei repository o credenziali Git. Durante il collegamento di GitHub App, il browser invia un codice OAuth transitorio; il relay usa un token utente GitHub App transitorio e monouso solo per verificare l’autorità del proprietario personale o dell’organizzazione, memorizza esclusivamente l’ID numerico dell’utente autorizzante, non conserva né registra mai nei log dell’applicazione nessuna delle due credenziali e tenta best effort di revocare il token. I payload webhook GitHub firmati possono includere metadati su repository, commit, percorso e autore forniti da GitHub; il relay estrae solo l’ID numerico del repository insieme al branch e ai dati di consegna e non conserva né registra nomi, URL, messaggi di commit, percorsi modificati, autori, contenuti o credenziali. I payload APNs contengono solo ID opachi.
ja: 全体への同意は、Background Sync を確定した後にのみ有効になります。アプリがリポジトリ名、URL、内容、ローカル path、Git 認証情報を relay API に送信することはありません。GitHub App のリンク時、ブラウザは一時的な OAuth コードを送信します。relay は個人所有者または組織所有者の権限確認だけを目的として、専用の一時的な GitHub App ユーザートークンを使用し、承認ユーザーの数値 ID のみを保存します。いずれの認証情報も永続化またはアプリケーションログへの記録を行わず、ベストエフォートでトークンを失効させます。署名済み GitHub webhook payload には、GitHub が提供するリポジトリ、commit、path、作成者のメタデータが含まれる場合があります。relay はリポジトリの数値 ID、branch、配信データのみを抽出し、名前、URL、commit メッセージ、変更された path、作成者、内容、認証情報を保存または記録しません。APNs payload には不透明な ID のみが含まれます。
ko: 전역 동의는 Background Sync를 확인한 후에만 시작됩니다. 앱은 저장소 이름, URL, 콘텐츠, 로컬 경로 또는 Git 자격 증명을 릴레이 API로 절대 보내지 않습니다. GitHub App 연결 중 브라우저는 일시적인 OAuth 코드를 전송합니다. 릴레이는 개인 소유자 또는 조직 소유자 권한을 확인하는 용도로만 단일 목적의 일시적인 GitHub App 사용자 토큰을 사용하고, 승인한 사용자의 숫자 ID만 저장하며, 두 자격 증명 모두 영구 저장하거나 애플리케이션 로그에 기록하지 않고, 최선을 다해 토큰을 취소합니다. 서명된 GitHub 웹후크 페이로드에는 GitHub에서 제공한 저장소, commit, 경로 및 작성자 메타데이터가 포함될 수 있습니다. 릴레이는 숫자 저장소 ID와 브랜치 및 전송 데이터만 추출하며 이름, URL, commit 메시지, 변경된 경로, 작성자, 콘텐츠 또는 자격 증명을 영구 저장하거나 기록하지 않습니다. APNs 페이로드에는 불투명 ID만 포함됩니다.
nb: Det globale samtykket starter først etter at du bekrefter Background Sync. Appen sender aldri repositorienavn, URL-er, innhold, lokale baner eller Git-legitimasjon til rele-API-er. Ved tilknytning av GitHub App sender nettleseren en midlertidig OAuth-kode. Releet bruker et midlertidig GitHub App-brukertoken med ett formål, kun for å bekrefte myndighet som personlig eier eller organisasjonseier. Det lagrer bare den numeriske ID-en til brukeren som godkjenner, lagrer aldri noen av legitimasjonene permanent eller i programlogger og tilbakekaller tokenet etter beste evne. Signerte GitHub-webhookdata kan inneholde metadata fra GitHub om repositorium, commit, bane og forfatter. Releet trekker bare ut numerisk repositorie-ID samt branch- og leveringsdata, og lagrer ikke navn, URL-er, commit-meldinger, endrede baner, forfattere, innhold eller legitimasjon permanent eller i logger. APNs-data inneholder bare ugjennomsiktige ID-er.
nl: Algemene toestemming begint pas nadat u Background Sync bevestigt. De app stuurt nooit repositorynamen, URL's, inhoud, lokale paden of Git-inloggegevens naar relay-API's. Tijdens het koppelen van GitHub App stuurt de browser een tijdelijke OAuth-code; de relay gebruikt een tijdelijk GitHub App-gebruikerstoken voor één doel, uitsluitend om de bevoegdheid van een persoonlijke eigenaar of organisatie-eigenaar te verifiëren, slaat alleen de numerieke ID van de autoriserende gebruiker op, bewaart of registreert geen van beide inloggegevens ooit in applicatielogboeken en trekt het token naar beste vermogen in. Ondertekende GitHub-webhookpayloads kunnen door GitHub verstrekte metadata over repository, commit, pad en auteur bevatten; de relay extraheert alleen de numerieke repository-ID plus branch- en afleveringsgegevens en bewaart of registreert geen namen, URL's, commit-berichten, gewijzigde paden, auteurs, inhoud of inloggegevens. APNs-payloads bevatten alleen ondoorzichtige ID's.
pl: Globalna zgoda zaczyna obowiązywać dopiero po potwierdzeniu Background Sync. Aplikacja nigdy nie wysyła do interfejsów API usługi pośredniczącej nazw ani adresów URL repozytoriów, ich zawartości, ścieżek lokalnych ani danych logowania Git. Podczas łączenia GitHub App przeglądarka wysyła tymczasowy kod OAuth; usługa pośrednicząca używa jednorazowego tymczasowego tokenu użytkownika GitHub App wyłącznie do weryfikacji uprawnień właściciela konta osobistego lub organizacji, przechowuje tylko numeryczny identyfikator autoryzującego użytkownika, nigdy nie zapisuje ani nie rejestruje w dzienniku aplikacji żadnych danych logowania i w miarę możliwości unieważnia token. Podpisane ładunki webhook GitHub mogą zawierać pochodzące z GitHub metadane repozytorium, commit, ścieżki i autora; usługa pośrednicząca wyodrębnia tylko numeryczny identyfikator repozytorium oraz dane gałęzi i dostarczenia, a nie przechowuje ani nie rejestruje nazw, adresów URL, komunikatów commit, zmienionych ścieżek, autorów, zawartości ani danych logowania. Ładunki APNs zawierają tylko nieprzejrzyste identyfikatory.
pt_br: O consentimento global só começa depois que você confirma o Background Sync. O app nunca envia nomes, URLs, conteúdo, caminhos locais de repositórios nem credenciais Git para APIs do retransmissor. Durante a vinculação do GitHub App, o navegador envia um código OAuth temporário; o retransmissor usa um token temporário de usuário do GitHub App com finalidade única somente para verificar a autoridade do proprietário pessoal ou da organização, armazena apenas o ID numérico do usuário que autoriza, nunca persiste nem registra no log do app nenhuma das credenciais e revoga o token na medida do possível. Cargas de webhooks assinados do GitHub podem incluir metadados de repositório, commit, caminho e autor fornecidos pelo GitHub; o retransmissor extrai apenas o ID numérico do repositório, além dos dados de branch e entrega, e não persiste nem registra nomes, URLs, mensagens de commit, caminhos alterados, autores, conteúdo ou credenciais. As cargas de APNs contêm somente IDs opacos.
ru: Общее согласие начинает действовать только после подтверждения Background Sync. Приложение никогда не отправляет API ретранслятора названия и URL-адреса репозиториев, их содержимое, локальные пути или учётные данные Git. При связывании GitHub App браузер отправляет временный код OAuth; ретранслятор использует одноцелевой временный пользовательский токен GitHub App только для проверки полномочий владельца личной учётной записи или организации, хранит только числовой идентификатор авторизующего пользователя, никогда не сохраняет и не записывает в журнал приложения какие-либо из этих учётных данных и по мере возможности отзывает токен. Подписанные данные веб-перехватчиков GitHub могут содержать предоставленные GitHub метаданные репозитория, commit, пути и автора; ретранслятор извлекает только числовой идентификатор репозитория, а также данные ветки и доставки и не сохраняет и не записывает в журнал названия, URL-адреса, сообщения commit, изменённые пути, авторов, содержимое или учётные данные. Полезная нагрузка APNs содержит только непрозрачные идентификаторы.
sv: Det globala samtycket börjar gälla först när du bekräftar Background Sync. Appen skickar aldrig arkivnamn, URL:er, innehåll, lokala sökvägar eller Git-autentiseringsuppgifter till relä-API:er. Vid länkning av GitHub App skickar webbläsaren en tillfällig OAuth-kod. Reläet använder en tillfällig GitHub App-användartoken för ett enda ändamål: att verifiera behörighet som personlig ägare eller organisationsägare. Det lagrar endast det numeriska användar-ID:t för den som godkänner, varken sparar eller programloggar någon av autentiseringsuppgifterna och återkallar token efter bästa förmåga. Signerade GitHub-webhook-nyttolaster kan innehålla metadata från GitHub om arkiv, commit, sökväg och författare. Reläet extraherar endast numeriskt arkiv-ID samt branch- och leveransdata och sparar eller loggar inte namn, URL:er, commit-meddelanden, ändrade sökvägar, författare, innehåll eller autentiseringsuppgifter. APNs-nyttolaster innehåller endast ogenomskinliga ID:n.
th: ความยินยอมส่วนกลางจะเริ่มต้นหลังจากคุณยืนยัน Background Sync เท่านั้น แอปจะไม่ส่งชื่อคลัง, URL, เนื้อหา, เส้นทางในเครื่อง หรือข้อมูลประจำตัว Git ไปยัง API ของรีเลย์ ขณะเชื่อมโยง GitHub App เบราว์เซอร์จะส่งรหัส OAuth ชั่วคราว รีเลย์จะใช้ token ผู้ใช้ GitHub App ชั่วคราวที่มีวัตถุประสงค์เดียวเพื่อตรวจสอบสิทธิ์เจ้าของส่วนบุคคลหรือเจ้าขององค์กรเท่านั้น โดยจัดเก็บเฉพาะ ID ผู้ใช้แบบตัวเลขของผู้อนุญาต ไม่เก็บข้อมูลประจำตัวทั้งสองไว้หรือบันทึกลงบันทึกของแอป และพยายามเพิกถอน token เท่าที่ทำได้ เพย์โหลด webhook ของ GitHub ที่ลงนามแล้วอาจมีข้อมูลเมตาของคลัง, commit, เส้นทาง และผู้เขียนที่ GitHub ให้มา รีเลย์จะดึงเฉพาะ ID คลังแบบตัวเลข พร้อมข้อมูล branch และการส่งมอบ และไม่เก็บหรือบันทึกชื่อ, URL, ข้อความ commit, เส้นทางที่เปลี่ยนแปลง, ผู้เขียน, เนื้อหา หรือข้อมูลประจำตัว เพย์โหลด APNs มีเฉพาะ ID ที่ไม่สื่อความหมาย
tr: Genel onay yalnızca Background Sync özelliğini onaylamanızdan sonra başlar. Uygulama depo adlarını, URL'leri, içerikleri, yerel yolları veya Git kimlik bilgilerini aktarıcı API'lerine hiçbir zaman göndermez. GitHub App bağlanırken tarayıcı geçici bir OAuth kodu gönderir; aktarıcı, yalnızca kişisel sahip veya kuruluş sahibi yetkisini doğrulamak amacıyla tek kullanımlık geçici bir GitHub App kullanıcı token'ı kullanır, yalnızca yetkilendiren kullanıcının sayısal kimliğini saklar, her iki kimlik bilgisini de hiçbir zaman kalıcı olarak saklamaz veya uygulama günlüğüne yazmaz ve token'ı mümkün olan en iyi şekilde iptal eder. İmzalı GitHub webhook yükleri, GitHub tarafından sağlanan depo, commit, yol ve yazar meta verilerini içerebilir; aktarıcı yalnızca sayısal depo kimliğiyle branch ve teslimat verilerini çıkarır ve adları, URL'leri, commit mesajlarını, değiştirilen yolları, yazarları, içerikleri veya kimlik bilgilerini kalıcı olarak saklamaz ya da günlüğe yazmaz. APNs yükleri yalnızca opak kimlikler içerir.
uk: Загальна згода набуває чинності лише після підтвердження Background Sync. Застосунок ніколи не надсилає API ретранслятора назви, URL-адреси, вміст чи локальні шляхи репозиторіїв або облікові дані Git. Під час підключення GitHub App браузер надсилає тимчасовий код OAuth; ретранслятор використовує одноцільовий тимчасовий токен користувача GitHub App лише для перевірки повноважень власника особистого облікового запису чи організації, зберігає лише числовий ідентифікатор користувача, який надав авторизацію, ніколи не зберігає та не записує до журналів застосунку жодні з цих облікових даних і за принципом максимально можливого відкликає токен. Підписані корисні дані вебхуків GitHub можуть містити надані GitHub метадані репозиторію, commit, шляху й автора; ретранслятор вилучає лише числовий ідентифікатор репозиторію, а також дані гілки й доставки та не зберігає й не журналює назви, URL-адреси, повідомлення commit, змінені шляхи, авторів, вміст або облікові дані. Корисні дані APNs містять лише непрозорі ідентифікатори.
vi: Sự đồng ý chung chỉ bắt đầu sau khi bạn xác nhận Background Sync. Ứng dụng không bao giờ gửi tên, URL, nội dung, đường dẫn cục bộ của kho lưu trữ hoặc thông tin đăng nhập Git đến các API chuyển tiếp. Trong khi liên kết GitHub App, trình duyệt sẽ gửi một mã OAuth tạm thời; dịch vụ chuyển tiếp chỉ dùng token người dùng GitHub App tạm thời, chuyên biệt để xác minh quyền của chủ sở hữu cá nhân hoặc chủ sở hữu tổ chức, chỉ lưu ID số của người dùng ủy quyền, không bao giờ lưu trữ lâu dài hoặc ghi một trong hai thông tin đăng nhập vào nhật ký ứng dụng, đồng thời thu hồi token theo khả năng tốt nhất. Dữ liệu webhook GitHub đã ký có thể bao gồm siêu dữ liệu do GitHub cung cấp về kho lưu trữ, commit, đường dẫn và tác giả; dịch vụ chuyển tiếp chỉ trích xuất ID số của kho lưu trữ cùng dữ liệu nhánh và lần gửi, đồng thời không lưu trữ lâu dài hoặc ghi nhật ký tên, URL, thông báo commit, đường dẫn đã thay đổi, tác giả, nội dung hoặc thông tin đăng nhập. Dữ liệu APNs chỉ chứa các ID không rõ nghĩa.
zh_hans: 只有在您确认 Background Sync 后，全局同意才会生效。应用绝不会向中继 API 发送仓库名称、URL、内容、本地路径或 Git 凭据。关联 GitHub App 时，浏览器会发送一个临时 OAuth 代码；中继服务仅使用单一用途的临时 GitHub App 用户令牌来验证个人所有者或组织所有者权限，仅存储授权用户的数字 ID，绝不持久保存这两项凭据，也不会将其写入应用日志，并会尽力撤销该令牌。已签名的 GitHub webhook 载荷可能包含 GitHub 提供的仓库、commit、路径和作者元数据；中继服务仅提取数字仓库 ID、分支和传送数据，不会持久保存或记录名称、URL、commit 消息、更改的路径、作者、内容或凭据。APNs 载荷仅包含不透明 ID。
zh_hant: 只有在您確認 Background Sync 後，全域同意才會生效。App 絕不會向中繼 API 傳送儲存庫名稱、URL、內容、本機路徑或 Git 憑證。連結 GitHub App 時，瀏覽器會傳送一個暫時的 OAuth 代碼；中繼服務僅使用單一用途的暫時 GitHub App 使用者權杖來驗證個人擁有者或組織擁有者權限，僅儲存授權使用者的數字 ID，絕不永久保存這兩項憑證，也不會將其寫入應用程式記錄，並會盡力撤銷該權杖。已簽署的 GitHub webhook 承載資料可能包含 GitHub 提供的儲存庫、commit、路徑和作者中繼資料；中繼服務僅擷取數字儲存庫 ID、分支和傳送資料，不會永久保存或記錄名稱、URL、commit 訊息、變更的路徑、作者、內容或憑證。APNs 承載資料僅包含不透明 ID。
